In [278]:
import pandas as pd

df = pd.read_csv('salaryData.csv')

df.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [279]:
df.shape

(375, 6)

In [280]:
df.describe()

              Age  Years of Experience         Salary
count  373.000000           373.000000     373.000000
mean    37.431635            10.030831  100577.345845
std      7.069073             6.557007   48240.013482
min     23.000000             0.000000     350.000000
25%     31.000000             4.000000   55000.000000
50%     36.000000             9.000000   95000.000000
75%     44.000000            15.000000  140000.000000
max     53.000000            25.000000  250000.000000

In [281]:
df.isnull().sum()

Age                    2
Gender                 2
Education Level        2
Job Title              2
Years of Experience    2
Salary                 2
dtype: int64

In [282]:
df = df.dropna()

In [283]:
df.isnull().sum()

Age                    0
Gender                 0
Education Level        0
Job Title              0
Years of Experience    0
Salary                 0
dtype: int64

In [284]:
df.describe()

              Age  Years of Experience         Salary
count  373.000000           373.000000     373.000000
mean    37.431635            10.030831  100577.345845
std      7.069073             6.557007   48240.013482
min     23.000000             0.000000     350.000000
25%     31.000000             4.000000   55000.000000
50%     36.000000             9.000000   95000.000000
75%     44.000000            15.000000  140000.000000
max     53.000000            25.000000  250000.000000

In [285]:
df.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [286]:
df.dtypes

Age                    float64
Gender                  object
Education Level         object
Job Title               object
Years of Experience    float64
Salary                 float64
dtype: object

In [287]:
df['Job Title'].value_counts()

Director of Marketing              12
Director of Operations             11
Senior Business Analyst            10
Senior Marketing Analyst            9
Senior Marketing Manager            9
                                   ..
Business Development Manager        1
Customer Service Representative     1
IT Manager                          1
Digital Marketing Manager           1
Junior Web Developer                1
Name: Job Title, Length: 174, dtype: int64

In [288]:
df['Education Level'].value_counts()

Bachelor's    224
Master's       98
PhD            51
Name: Education Level, dtype: int64

In [289]:
df_edited = df.groupby('Job Title').filter(lambda x : len(x)>4)
df_edited.info()
df_edited['Job Title'].value_counts()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 147 entries, 47 to 374
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  147 non-null    float64
 1   Gender               147 non-null    object
 2   Education Level      147 non-null    object
 3   Job Title            147 non-null    object
 4   Years of Experience  147 non-null    float64
 5   Salary               147 non-null    float64
dtypes: float64(3), object(3)
memory usage: 8.0+ KB

Director of Marketing                    12
Director of Operations                   11
Senior Business Analyst                  10
Senior Marketing Manager                  9
Senior Marketing Analyst                  9
Junior Business Analyst                   8
Senior Data Scientist                     7
Senior Financial Analyst                  7
Senior Project Manager                    7
Junior Business Development Associate     7
Junior Financial Analyst                  7
Junior Marketing Coordinator              6
Senior Product Manager                    6
Senior Software Engineer                  6
Junior Marketing Specialist               5
Junior Project Manager                    5
Senior Product Designer                   5
Junior Operations Analyst                 5
Senior Operations Manager                 5
Senior Project Coordinator                5
Senior Financial Manager                  5
Name: Job Title, dtype: int64

In [290]:
df_edited['Job Title'] = df_edited['Job Title'].astype('category')

In [291]:
df_edited['Job Title Encoded'] = df_edited['Job Title'].cat.codes
df_edited.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary,Job Title Encoded
47,45.0,Female,Master's,Director of Marketing,16.0,180000.0,0
60,51.0,Female,Master's,Director of Operations,23.0,170000.0,1
63,47.0,Male,PhD,Senior Data Scientist,21.0,180000.0,10
69,49.0,Female,Master's,Senior Financial Analyst,18.0,150000.0,11
77,32.0,Male,Master's,Senior Software Engineer,6.0,100000.0,20

In [292]:
df_edited.dtypes

Age                     float64
Gender                   object
Education Level          object
Job Title              category
Years of Experience     float64
Salary                  float64
Job Title Encoded          int8
dtype: object

In [293]:
df_edited['Education Level'] = df_edited['Education Level'].astype('category')

In [294]:
df_edited.dtypes

Age                     float64
Gender                   object
Education Level        category
Job Title              category
Years of Experience     float64
Salary                  float64
Job Title Encoded          int8
dtype: object

In [295]:
df_edited['Education Level Encoded'] = df_edited['Education Level'].cat.codes
df_edited.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary,Job Title Encoded,Education Level Encoded
47,45.0,Female,Master's,Director of Marketing,16.0,180000.0,0,1
60,51.0,Female,Master's,Director of Operations,23.0,170000.0,1,1
63,47.0,Male,PhD,Senior Data Scientist,21.0,180000.0,10,2
69,49.0,Female,Master's,Senior Financial Analyst,18.0,150000.0,11,1
77,32.0,Male,Master's,Senior Software Engineer,6.0,100000.0,20,1

In [296]:
df_edited['Gender'] = df_edited['Gender'].astype('category')

In [297]:
df_edited['Gender Encoded'] = df_edited['Gender'].cat.codes
df_edited.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary,Job Title Encoded,Education Level Encoded,Gender Encoded
47,45.0,Female,Master's,Director of Marketing,16.0,180000.0,0,1,0
60,51.0,Female,Master's,Director of Operations,23.0,170000.0,1,1,0
63,47.0,Male,PhD,Senior Data Scientist,21.0,180000.0,10,2,1
69,49.0,Female,Master's,Senior Financial Analyst,18.0,150000.0,11,1,0
77,32.0,Male,Master's,Senior Software Engineer,6.0,100000.0,20,1,1

In [298]:
df_final = df_edited.drop(['Gender', 'Education Level', 'Job Title'], axis=1)
df_final.head()

,Age,Years of Experience,Salary,Job Title Encoded,Education Level Encoded,Gender Encoded
47,45.0,16.0,180000.0,0,1,0
60,51.0,23.0,170000.0,1,1,0
63,47.0,21.0,180000.0,10,2,1
69,49.0,18.0,150000.0,11,1,0
77,32.0,6.0,100000.0,20,1,1

In [299]:
df_final.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 147 entries, 47 to 374
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Age                      147 non-null    float64
 1   Years of Experience      147 non-null    float64
 2   Salary                   147 non-null    float64
 3   Job Title Encoded        147 non-null    int8
 4   Education Level Encoded  147 non-null    int8
 5   Gender Encoded           147 non-null    int8
dtypes: float64(3), int8(3)
memory usage: 5.0 KB

In [300]:
import numpy as np
import pickle
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_squared_error

In [301]:
X = df_final.iloc[:,[0,1,3,4,5]]
y = df_final.iloc[:,2]

In [302]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2)

In [303]:
X_train.head()

,Age,Years of Experience,Job Title Encoded,Education Level Encoded,Gender Encoded
104,39.0,13.0,18,1,0
345,33.0,4.0,2,0,1
280,31.0,3.0,7,0,1
249,47.0,20.0,1,1,1
250,30.0,2.0,5,0,0

In [304]:
y_train.head()

104     80000.0
345     60000.0
280     50000.0
249    170000.0
250     40000.0
Name: Salary, dtype: float64

In [305]:
reg = LinearRegression()
reg.fit(X_train, y_train)

LinearRegression()

In [306]:
y_pred = reg.predict(X_test)

In [307]:
err = np.sqrt(mean_squared_error(y_test, y_pred))

In [308]:
y_pred, y_test

(array([112144.86727584, 166583.83175337, 166508.89024796,  57581.82276718,
         85221.33177927,  95644.9509632 , 181771.55314633,  85221.33177927,
        183872.757387  ,  45837.21206766, 115937.87615385, 113144.59406643,
        150728.43359605,  57078.5554266 , 155747.49122074,  45585.57839737,
        104705.32939082,  92707.09631568, 102868.95219338, 163722.41605112,
        167020.95418445, 175956.67831008,  46088.84573795,  64878.77679743,
         59261.50906324, 164577.57028161,  53278.73865802,  93273.18682039,
         70074.526587  , 151404.90695632]),
 281     95000.0
 179    170000.0
 220    170000.0
 307     50000.0
 287     85000.0
 325    100000.0
 63     180000.0
 346     85000.0
 291    180000.0
 253     40000.0
 355    130000.0
 296    130000.0
 350    160000.0
 351     55000.0
 176    140000.0
 195     40000.0
 119    120000.0
 284    100000.0
 181    105000.0
 69     150000.0
 262    160000.0
 130    160000.0
 224     40000.0
 369     60000.0
 327     55000.0
 335    170000.0
 342     50000.0
 236    100000.0
 339     70000.0
 341    170000.0
 Name: Salary, dtype: float64)

In [309]:
err

9295.100781167877

In [310]:
print(pd.DataFrame(zip(X.columns, reg.coef_)))
print(reg.intercept_)

                         0            1
0                      Age  2182.953637
1      Years of Experience  4189.215108
2        Job Title Encoded   251.633670
3  Education Level Encoded  6550.849615
4           Gender Encoded  3548.183098
-27967.00408444948

In [312]:
pickle.dump(reg, open('model.pkl', 'wb'))